#include "china++/核心.h"
#include "china++/扩展/输入输出.h"

整数 主函数() {
  计次循环首(3)
    打印("计次循环: %d\n", 次数);
  计次循环尾

  打印("------------------------------\n");

  整数 次数 = 3;

  判断循环首(次数-->0)
    打印("先判断再循环\n");
  判断循环尾

  打印("------------------------------\n");

  次数 = 3;
  循环判断首
    打印("先循环再判断\n");
  循环判断尾(次数-->0)

  打印("------------------------------\n");

  计次循环(5) {
    如果(次数==1) {
      打印("苹果\n");
    } 又如(次数==2) {
      打印("梨子\n");
    } 又如(次数==3) {
      打印("香蕉\n");
    } 又如(次数==4) {
      打印("草莓\n");
    } 否则 {
      打印("鸭蛋\n");
    }
  }

  返回 0;
}